# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [15]:
#Your code here
import sqlite3
import pandas as pd
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cursor = connection.cursor()

## Display the names of all the employees in Boston.

In [16]:
#Your code here
cursor.execute("""select firstName, lastName from employees join offices using(OfficeCode) where city = 'Boston'""").fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [26]:
#Your code here
cursor.execute("""select city, count (*) from offices left join employees using(OfficeCode) group by 1;""").fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

In [29]:
# Comparing to solution's code.  Solution output looks a lot nicer, but returns same values.
cursor.execute("""select city,
                    count(*)
                    from offices
                    left join employees
                    using(officeCode)
                    group by 1;""")
df = pd.DataFrame(cursor.fetchall())
df.head(10)

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [ ]:
# 1. Do any of our employees have duplicate email addresses? - yes, there is 1 employee
# 2. What products do we sell again? - code shown below suggests we sell everything from Ford trucks to the Titanic.
# 3. Who is the boss around here? Diane Murphy is the President and works from the SF Office.

In [38]:
# Code for 1:
cursor.execute("""select email, count (*) from offices left join employees using(officeCode) group by 1;""").fetchall()
# df = pd.DataFrame(cursor.fetchall())
# df

[('abow@classicmodelcars.com', 1),
 ('afixter@classicmodelcars.com', 1),
 ('bjones@classicmodelcars.com', 1),
 ('dmurphy@classicmodelcars.com', 1),
 ('ftseng@classicmodelcars.com', 1),
 ('gbondur@classicmodelcars.com', 1),
 ('ghernande@classicmodelcars.com', 1),
 ('gvanauf@classicmodelcars.com', 1),
 ('jfirrelli@classicmodelcars.com', 2),
 ('lbondur@classicmodelcars.com', 1),
 ('lbott@classicmodelcars.com', 1),
 ('ljennings@classicmodelcars.com', 1),
 ('lthompson@classicmodelcars.com', 1),
 ('mgerard@classicmodelcars.com', 1),
 ('mnishi@classicmodelcars.com', 1),
 ('mpatterso@classicmodelcars.com', 1),
 ('pcastillo@classicmodelcars.com', 1),
 ('pmarsh@classicmodelcars.com', 1),
 ('spatterson@classicmodelcars.com', 1),
 ('tking@classicmodelcars.com', 1),
 ('wpatterson@classicmodelcars.com', 1),
 ('ykato@classicmodelcars.com', 1)]

In [39]:
# Code for 2.
cursor.execute("""select productName from products group by 1;""").fetchall()

[('18th Century Vintage Horse Carriage',),
 ('18th century schooner',),
 ('1900s Vintage Bi-Plane',),
 ('1900s Vintage Tri-Plane',),
 ('1903 Ford Model A',),
 ('1904 Buick Runabout',),
 ('1911 Ford Town Car',),
 ('1912 Ford Model T Delivery Wagon',),
 ('1913 Ford Model T Speedster',),
 ('1917 Grand Touring Sedan',),
 ('1917 Maxwell Touring Car',),
 ('1926 Ford Fire Engine',),
 ('1928 British Royal Navy Airplane',),
 ('1928 Ford Phaeton Deluxe',),
 ('1928 Mercedes-Benz SSK',),
 ('1930 Buick Marquette Phaeton',),
 ('1932 Alfa Romeo 8C2300 Spider Sport',),
 ('1932 Model A Ford J-Coupe',),
 ('1934 Ford V8 Coupe',),
 ('1936 Chrysler Airflow',),
 ('1936 Harley Davidson El Knucklehead',),
 ('1936 Mercedes Benz 500k Roadster',),
 ('1936 Mercedes-Benz 500K Special Roadster',),
 ('1937 Horch 930V Limousine',),
 ('1937 Lincoln Berline',),
 ('1938 Cadillac V-16 Presidential Limousine',),
 ('1939 Cadillac Limousine',),
 ('1939 Chevrolet Deluxe Coupe',),
 ('1940 Ford Delivery Sedan',),
 ('1940 Ford Pickup Truck',),
 ('1940s Ford truck',),
 ('1941 Chevrolet Special Deluxe Cabriolet',),
 ('1948 Porsche 356-A Roadster',),
 ('1948 Porsche Type 356 Roadster',),
 ('1949 Jaguar XK 120',),
 ("1950's Chicago Surface Lines Streetcar",),
 ('1952 Alpine Renault 1300',),
 ('1952 Citroen-15CV',),
 ('1954 Greyhound Scenicruiser',),
 ('1956 Porsche 356A Coupe',),
 ('1957 Chevy Pickup',),
 ('1957 Corvette Convertible',),
 ('1957 Ford Thunderbird',),
 ('1957 Vespa GS150',),
 ('1958 Chevy Corvette Limited Edition',),
 ('1958 Setra Bus',),
 ('1960 BSA Gold Star DBD34',),
 ('1961 Chevrolet Impala',),
 ('1962 City of Detroit Streetcar',),
 ('1962 LanciaA Delta 16V',),
 ('1962 Volkswagen Microbus',),
 ('1964 Mercedes Tour Bus',),
 ('1965 Aston Martin DB5',),
 ('1966 Shelby Cobra 427 S/C',),
 ('1968 Dodge Charger',),
 ('1968 Ford Mustang',),
 ('1969 Chevrolet Camaro Z28',),
 ('1969 Corvair Monza',),
 ('1969 Dodge Charger',),
 ('1969 Dodge Super Bee',),
 ('1969 Ford Falcon',),
 ('1969 Harley Davidson Ultimate Chopper',),
 ('1970 Chevy Chevelle SS 454',),
 ('1970 Dodge Coronet',),
 ('1970 Plymouth Hemi Cuda',),
 ('1970 Triumph Spitfire',),
 ('1971 Alpine Renault 1600s',),
 ('1972 Alfa Romeo GTA',),
 ('1974 Ducati 350 Mk3 Desmo',),
 ('1976 Ford Gran Torino',),
 ('1980s Black Hawk Helicopter',),
 ('1980â€™s GM Manhattan Express',),
 ('1982 Camaro Z28',),
 ('1982 Ducati 900 Monster',),
 ('1982 Ducati 996 R',),
 ('1982 Lamborghini Diablo',),
 ('1985 Toyota Supra',),
 ('1992 Ferrari 360 Spider red',),
 ('1992 Porsche Cayenne Turbo Silver',),
 ('1993 Mazda RX-7',),
 ('1995 Honda Civic',),
 ('1996 Moto Guzzi 1100i',),
 ('1996 Peterbilt 379 Stake Bed with Outrigger',),
 ('1997 BMW F650 ST',),
 ('1997 BMW R 1100 S',),
 ('1998 Chrysler Plymouth Prowler',),
 ('1999 Indy 500 Monte Carlo SS',),
 ('1999 Yamaha Speed Boat',),
 ('2001 Ferrari Enzo',),
 ('2002 Chevy Corvette',),
 ('2002 Suzuki XREO',),
 ('2002 Yamaha YZR M1',),
 ('2003 Harley-Davidson Eagle Drag Bike',),
 ('ATA: B757-300',),
 ('America West Airlines B757-200',),
 ('American Airlines: B767-300',),
 ('American Airlines: MD-11S',),
 ('Boeing X-32A JSF',),
 ('Collectable Wooden Train',),
 ('Corsair F4U ( Bird Cage)',),
 ('Diamond T620 Semi-Skirted Tanker',),
 ('F/A 18 Hornet 1/72',),
 ('HMS Bounty',),
 ('P-51-D Mustang',),
 ('Pont Yacht',),
 ('The Mayflower',),
 ('The Queen Mary',),
 ('The Schooner Bluenose',),
 ('The Titanic',),
 ('The USS Constitution Ship',)]

In [40]:
# Code for 3 pt1:
cursor.execute("""select jobTitle from employees left join offices using(officeCode) group by 1;""").fetchall()

[('President',),
 ('Sale Manager (EMEA)',),
 ('Sales Manager (APAC)',),
 ('Sales Manager (NA)',),
 ('Sales Rep',),
 ('VP Marketing',),
 ('VP Sales',)]

In [41]:
# Code for 3 pt2:
cursor.execute("""select * from employees left join offices using(officeCode) where jobTitle == 'President' group by 1;""").fetchall()

[('1002',
  'Murphy',
  'Diane',
  'x5800',
  'dmurphy@classicmodelcars.com',
  '1',
  '',
  'President',
  'San Francisco',
  '+1 650 219 4782',
  '100 Market Street',
  'Suite 300',
  'CA',
  'USA',
  '94080',
  'NA')]

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!